app/Http/Controllers/auth/AuthController.php

    public function login(Request $request)
    {
        $request->validate([
            'email' => 'required|email',
            'password' => 'required',
        ]);

        $user = User::where('email', $request->input('email'))->first();
---
select * from `users` where `email` = 'alumni.pending@example.com' limit 1