app/Http/Controllers/EventUserController.php

select * from `event_pengembangan_karir` where `event_pengembangan_karir`.`deleted_at` is null order by `created_at` desc
---
    public function index()
    {
        $user = Auth::user();
        if ($user->role !== 'alumni' || $user->status !== 'approved') {
            abort(403, 'Unauthorized');
        }
        $events = EventPengembanganKarir::orderByDesc('created_at')->get();

select * from `event_pengembangan_karir` where `event_pengembangan_karir`.`id` = '1' and `event_pengembangan_karir`.`deleted_at` is null limit 1
---
    public function order($eventId)
    {
        $user = Auth::user();
        if ($user->role !== 'alumni' || $user->status !== 'approved') {
            abort(403, 'Unauthorized');
        }
        $event = EventPengembanganKarir::findOrFail($eventId);

select * from `event_pengembangan_karir` where `event_pengembangan_karir`.`id` = '1' and `event_pengembangan_karir`.`deleted_at` is null limit 1
select * from `pendaftaran_event` where `event_id` = 1 and `user_id` = 5 limit 1
---
    public function daftar(Request $request, $eventId)
    {
        $user = Auth::user();
        if ($user->role !== 'alumni' || $user->status !== 'approved') {
            abort(403, 'Unauthorized');
        }
        $event = EventPengembanganKarir::findOrFail($eventId);
        // Cek jika sudah pernah daftar
        $sudahDaftar = PendaftaranEvent::where('event_id', $event->id)->where('user_id', $user->id)->first();

insert into `pendaftaran_event` (`event_id`, `user_id`, `status`, `updated_at`, `created_at`) values (1, 5, 'menunggu', '2025-05-22 16:47:20', '2025-05-22 16:47:20')
insert into `pembayaran_event` (`pendaftaran_event_id`, `status_pembayaran`, `jumlah`, `updated_at`, `created_at`) values (16, 'pending', 50000, '2025-05-22 16:47:20', '2025-05-22 16:47:20')
---
        }
        DB::beginTransaction();
        try {
            $pendaftaran = PendaftaranEvent::create([
                'event_id' => $event->id,
                'user_id' => $user->id,
                'status' => $event->harga_daftar > 0 ? 'menunggu' : 'berhasil',
            ]);
            if ($event->harga_daftar > 0) {
                // Buat baris pembayaran status menunggu
                $pembayaran = PembayaranEvent::create([
                    'pendaftaran_event_id' => $pendaftaran->id,
                    'status_pembayaran' => 'pending',
                    'jumlah' => $event->harga_daftar,
                ]);