app/Http/Controllers/ProfileController.php

    public function index()
    {
        if (!Auth::check()) {
            return redirect()->route('login')->with('error', 'Anda harus login terlebih dahulu.');
        }

        /** @var User $user */
        $user = Auth::user();

        // Hanya izinkan user dengan status pending atau approved
        if (!in_array($user->status, ['approved', 'pending'])) {
            Auth::logout();
            return redirect()->route('login')->with('error', 'Akun Anda tidak diizinkan mengakses profil.');
        }

        // Load relasi sesuai role
        $user->load([
            $user->role === 'admin' ? 'profilAdmin' : 'profilAlumni'
        ]);
---
select * from `profil_admin` where `profil_admin`.`user_id` in (2) and `profil_admin`.`deleted_at` is null
select * from `profil_alumni` where `profil_alumni`.`user_id` in (4)

                'email_alternatif'=> 'nullable|email|max:255',
            ]);

            $user->profilAlumni()->updateOrCreate(
                ['user_id' => $user->id],
                $request->only([
                    'nim', 'jurusan', 'no_telepon', 'alamat_rumah',
                    'linkedin', 'instagram', 'email_alternatif'
                ])
            );
---
select * from `profil_alumni` where (`user_id` = 5) limit 1