app/Http/Controllers/ProfileController.php

    public function index(Request $request)
    {
        $id = $request->input('id');
        $role = $request->input('role');
        $status = $request->input('status');

        // Jika parameter dikirim manual (misal dari query string)
        if (!empty($id) && !empty($role) && !empty($status)) {
            $user = \App\Models\User::find($id);
---
select * from `users` where `users`.`id` = 5 limit 1