app/Http/Controllers/Dashboard/DashboardController.php

select count(*) as aggregate from `users` where `status` = 'approved' and `role` = 'alumni'
select count(*) as aggregate from `users` where `status` = 'pending' and `role` = 'alumni'
---
    public function dashboard(Request $request)
    {
        // Pastikan user terautentikasi dan memiliki hak akses
        $this->authorizeDashboard();

        $userData = $this->getUserData();
        $profil = $this->getUserProfile($userData['id'], $userData['role']);

        $jumlahPenggunaDisetujui = User::where('status', 'approved')
            ->where('role', 'alumni')
            ->count();

        $jumlahPenggunaPending = User::where('status', 'pending')
            ->where('role', 'alumni')
            ->count();

select * from `respon_kuesioner` inner join `profil_alumni` on `profil_alumni`.`user_id` = `respon_kuesioner`.`user_id` where `profil_alumni`.`jurusan` is not null and `profil_alumni`.`jurusan` = 'Broadcasting (D3)'
select `profil_alumni`.`tahun_lulus`, COUNT(profil_alumni.id) as total_alumni, COUNT(DISTINCT respon_kuesioner.user_id) as total_responden from `profil_alumni` left join `respon_kuesioner` on `profil_alumni`.`user_id` = `respon_kuesioner`.`user_id` group by `profil_alumni`.`tahun_lulus`
---
    private function getAlumniAndRespondents($jurusanDefault = null)
    {
        $query = ProfilAlumni::select(
            'profil_alumni.tahun_lulus',
            DB::raw('COUNT(profil_alumni.id) as total_alumni'),
            DB::raw('COUNT(DISTINCT respon_kuesioner.user_id) as total_responden')
        )
            ->leftJoin('respon_kuesioner', 'profil_alumni.user_id', '=', 'respon_kuesioner.user_id')
            ->groupBy('profil_alumni.tahun_lulus');

        if ($jurusanDefault) {
            $query->where('profil_alumni.jurusan', $jurusanDefault);
        }

        return $query->get();

select * from `profil_alumni` where `profil_alumni`.`user_id` in (4)
select * from `respon_kuesioner` inner join `profil_alumni` on `profil_alumni`.`user_id` = `respon_kuesioner`.`user_id` where `profil_alumni`.`jurusan` is not null and `profil_alumni`.`jurusan` = 'Broadcasting (D3)'
select * from `users` where `users`.`id` in (4)
---
    private function getQuestionnaireResponses($jurusan = null, $jurusanDefault = null): array
    {
        $responses = ResponKuesioner::with('user.profilAlumni')
            ->join('profil_alumni', 'profil_alumni.user_id', '=', 'respon_kuesioner.user_id')
            ->whereNotNull('profil_alumni.jurusan')
            ->when($jurusan, fn($query) => $query->where('profil_alumni.jurusan', $jurusan))
            ->when($jurusanDefault, fn($query) => $query->where('profil_alumni.jurusan', $jurusanDefault))
            ->get();