app/Http/Controllers/Dashboard/DashboardController.php

select * from `profil_admin` where `user_id` = 2 and `profil_admin`.`deleted_at` is null limit 1
---
    private function getUserProfile($user)
    {
        if ($user->role === 'admin') {
            return ProfilAdmin::where('user_id', $user->id)->first();

select `tahun_lulus`, COUNT(profil_alumni.id) as total_alumni, COUNT(DISTINCT respon_kuesioner.user_id) as total_responden from `profil_alumni` left join `respon_kuesioner` on `profil_alumni`.`user_id` = `respon_kuesioner`.`user_id` where `profil_alumni`.`jurusan` = 'Ilmu Komunikasi (S1)' group by `tahun_lulus`
---
    private function getAlumniStats($jurusan = null)
    {
        return ProfilAlumni::select(
            'tahun_lulus',
            DB::raw('COUNT(profil_alumni.id) as total_alumni'),
            DB::raw('COUNT(DISTINCT respon_kuesioner.user_id) as total_responden')
        )
            ->leftJoin('respon_kuesioner', 'profil_alumni.user_id', '=', 'respon_kuesioner.user_id')
            ->when($jurusan, fn($q) => $q->where('profil_alumni.jurusan', $jurusan))
            ->groupBy('tahun_lulus')
            ->get();