app/Http/Controllers/Dashboard/MemberSettingController.php

select count(*) as aggregate from `profil_alumni` where exists (select * from `users` where `profil_alumni`.`user_id` = `users`.`id` and `role` = 'alumni')
select * from `profil_alumni` where `profil_alumni`.`user_id` in (1, 4, 5, 6)
select * from `users` where `role` = 'alumni' limit 10 offset 0
select count(*) as aggregate from `users` where `role` = 'alumni'
---
    public function index(Request $request)
    {
        $query = User::with('profilAlumni')->where('role', 'alumni');

        if ($search = $request->query('search')) {
            $query->where(function ($q) use ($search) {
                $q->where('nama', 'like', "%{$search}%")
                  ->orWhere('email', 'like', "%{$search}%");
            });
        }

        $alumni = $query->paginate(10);

select * from `users` where `users`.`id` in (4, 5, 6)
---
    public function show($id)
    {
        $alumni = User::with('profilAlumni')->where('role', 'alumni')->findOrFail($id);