app/Http/Controllers/Dashboard/MemberSettingController.php

select `user_id` from `profil_alumni`
select `id` from `users` where `id` not in (4, 5, 6) and `role` = 'alumni' order by `updated_at` desc
---
    public function memberSetting(Request $request)
    {
        if (!Auth::check()) {
            abort(403, 'Unauthorized action.');
        }

        $dataPengguna = $this->decryptUserData();

        if ($dataPengguna['status'] !== 'approved') {
            return redirect()->route('login')->with('error', 'Anda belum di-approve oleh admin.');
        }

        $alumniIds = ProfilAlumni::pluck('user_id')->toArray();

        $users = User::whereNotIn('id', $alumniIds)
            ->where('role', 'alumni')
            ->select('id')
            ->orderByDesc('updated_at')
            ->get();

select * from `profil_alumni` where `profil_alumni`.`id` = '2' limit 1
---
    public function ambilDataAlumni($id)
    {
        $alumni = ProfilAlumni::find($id);

select * from `profil_alumni` where `profil_alumni`.`id` = '2' limit 1
update `profil_alumni` set `nim` = '1111111', `profil_alumni`.`updated_at` = '2025-05-19 18:45:36' where `id` = 2
---
    public function update(Request $request, $id)
    {
        $request->validate([
            'nim' => 'required|string|max:20',
            'nama' => 'required|string|max:255',
        ]);

        $alumni = ProfilAlumni::find($id);

        if (!$alumni) {
            return response()->json(['error' => 'Data not found'], 404);
        }

        $alumni->update($request->only(['nim', 'nama']));

delete from `profil_alumni` where `id` = 2
select * from `profil_alumni` where `profil_alumni`.`id` = '2' limit 1
---
    public function destroy($id)
    {
        try {
            ProfilAlumni::findOrFail($id)->delete();

select * from `profil_alumni` limit 10 offset 0
select `id`, `nama` from `users` where `users`.`id` in (4, 5, 6)
select count(*) as aggregate from `profil_alumni`
---
    private function getPaginatedAlumniProfiles(Request $request)
    {
        return ProfilAlumni::with('user:id,nama') // Eager load the user relationship and select the nama field
            ->paginate(10);

select * from `profil_alumni` where `profil_alumni`.`id` = '1' limit 1
---
    private function findAlumni($id)
    {
        try {
            return response()->json(ProfilAlumni::findOrFail($id));