app/Http/Controllers/Dashboard/UserSettingController.php

select * from `users` limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function index(Request $request)
    {
        $query = User::query();

        if ($search = $request->query('search')) {
            $query->where(function ($q) use ($search) {
                $q->where('nama', 'like', "%{$search}%")
                  ->orWhere('email', 'like', "%{$search}%");
            });
        }

        return response()->json($query->paginate(10));