app/Http/Controllers/Dashboard/UserSettingController.php

select * from `users` where `role` = 'alumni' and (`role` like '%pending%' or `status` like '%pending%') limit 10 offset 0
select count(*) as aggregate from `users` where `role` = 'alumni' and (`role` like '%pending%' or `status` like '%pending%')
---
    private function getPaginatedUsers(Request $request)
    {
        $search = $request->input('search');
        $query = User::where('role', 'alumni');

        if ($search) {
            $query->where(function ($q) use ($search) {
                $q->orWhere('role', 'like', "%{$search}%")
                    ->orWhere('status', 'like', "%{$search}%");
            });
        }

        return $query->paginate(10);